class errors:
    CommandNotFound = "⚠ Команда не найдена"
    UserNotAdmin = "⚠ <a href='tg://user?id={}'>Вы</a> не админ"


class chat:
    start_pineapple = "🍍🎉 Еху я в ананасах 🎉🍍"
    start_not_pineapple = "Бота не будет он в группе @FunnyPineappleChat🍍"
    decline_last_message = "У <a href='tg://user?id={}'>вас</a> есть 1️⃣0️⃣ секунд чтобы написать последнее сообщение 💬"
    decline = "Пользователь <a href='tg://user?id={user_id}'>{user_name}</a> был исключён из пати администратором <a href='tg://user?id={admin_id}'>{admin_name}</a>"
    accept = "<a href='tg://user?id={user_id}'>Вы</a> приняты в pineapple🍍 пати администратором <a href='tg://user?id={admin_id}'>{admin_name}</a>"

    new_member = "Привет чел! \n" +\
                 "Если ты пришел сюда что то рекламировать то просим на выход \n" +\
                 "Иначе жди одобрения \n"


class private:
    start = "Чел если ты пришел сюда для бота то его не будет он в группе @FunnyPineappleChat"
